#Для повторение одних и тех же действий несколько раз используются циклы
#В данной программе представлен один вид циклов: for-цикл
#Суть for-цикла заключается в том, что он позволяет перебрать все элементы списка или выполнить действие 
#фиксированное количество раз
lst = [1,2,-4,5,-10] #создадим список
for item in lst: # запустим цикл по элементам этого списка
    print(item * 2) # и будем печатать каждый элемент списка умноженный на 2


# если вы уберете решетки перед началом строчек у кода ниже, то сможете запустить написанную на уроке
# программу для поиска числа Фибоначчи под нужным номером


#number = int(input())
#num_1 = 1
#num_2 = 1
#for item in range(number):
#    c = num_2
#    num_2 = num_1 + num_2
#    num_1 = c 

#print(num_2)
