#это комментарии, тут можно писать пояснительный текст, на который компьютер не будет обращать внимания
a = 1 #в переменную под названием 'a' мы положили значение 1
b = 'Hello world!'#в переменную под названием 'b' мы положили строку "Hello world!"
print(a)#давайте напечатаем нашу переменную "а"
print(b) # и 'b'
#а что если теперь мы положим в переменную 'a' число "2"?
a = 2
print(a) #мы видим, что теперь 1 из переменной 'a' пропала и теперь там лежит 2

#task 1 
#создайте переменую, присвойте ей строку "Hello world!" и напечатайте ее

#task 2 
#у вас есть две переменные: a = 2 и b = 1. Поменяйте местами их значения так, чтобы
# a = 1, а b = 2

