#and, or, not, разобрать все на доске
#операторы сравнения
print('Enter first number:')
a = int(input())
print('Enter second number:')
b = int(input())
bool = a > b
print("a>b:")
print(bool)

#написать программу которая определяет входит ли число в промежуток